ch11/ch11-2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-08-17 Thu 10:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chapter 11.2</title>
<meta name="author" content="pedh" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/css/org-info.css" />



</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/CLRS-Solutions"> UP </a>
 |
 <a accesskey="H" href="/CLRS-Solutions"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Chapter 11.2</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga2a7942">ch11.2</a>
<ul>
<li><a href="#orgbafb123">11.2-1</a></li>
<li><a href="#org05ffb0e">11.2-2</a></li>
<li><a href="#org5105abe">11.2-3</a></li>
<li><a href="#orgaf3b484">11.2-4</a></li>
<li><a href="#orgbc44c11">11.2-5</a></li>
<li><a href="#orgd96e0d2">11.2-6</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orga2a7942" class="outline-2">
<h2 id="orga2a7942">ch11.2</h2>
<div class="outline-text-2" id="text-orga2a7942">
</div>
<div id="outline-container-orgbafb123" class="outline-3">
<h3 id="orgbafb123">11.2-1</h3>
<div class="outline-text-3" id="text-orgbafb123">
<p>
Let \(k_1, k_2, ..., k_n\) denote the \(n\) distinct keys, for keys \(k_i\)
and \(k_j\), we define the indicator random variable
\(X_{ij} = I\{h(k_i)=h(k_j)\}\). Under the assumption of simple uniform
hashing, we have \(Pr\{h(k_i)=h(k_j)\}=1/m\), and so by Lemma 5.1, we have
\(E[X_{ij}]=1/m\). Thus, the expected number of collisions is
</p>
\begin{align*}
C(n,m)
&=\sum_{i=1}^{n}\sum_{j=i+1}^{n}E[X_{ij}]\\
&=\sum_{i=1}^{n}\frac{n-i}{m}\\
&=\frac{n^2-n}{2m}
\end{align*}
</div>
</div>
<div id="outline-container-org05ffb0e" class="outline-3">
<h3 id="org05ffb0e">11.2-2</h3>
<div class="outline-text-3" id="text-org05ffb0e">
<pre class="example">
1. The keys remaining: 5, 28, 19, 15, 20, 33, 12, 17, 10
|---+---+---+---+---+---+---+---+---|
| 0 | 1 | 2 | 3 | 4 | 5 | 6 | 7 | 8 |
|---+---+---+---+---+---+---+---+---|
|   |   |   |   |   |   |   |   |   |
|---+---+---+---+---+---+---+---+---|

2. The keys remaining: 28, 19, 15, 20, 33, 12, 17, 10
|---+---+---+---+---+-----+---+---+---|
| 0 | 1 | 2 | 3 | 4 |   5 | 6 | 7 | 8 |
|---+---+---+---+---+-----+---+---+---|
|   |   |   |   |   | (5) |   |   |   |
|---+---+---+---+---+-----+---+---+---|

3. The keys remaining: 19, 15, 20, 33, 12, 17, 10
|---+------+---+---+---+-----+---+---+---|
| 0 |    1 | 2 | 3 | 4 |   5 | 6 | 7 | 8 |
|---+------+---+---+---+-----+---+---+---|
|   | (28) |   |   |   | (5) |   |   |   |
|---+------+---+---+---+-----+---+---+---|

4. The keys remaining: 15, 20, 33, 12, 17, 10
|---+----------+---+---+---+-----+---+---+---|
| 0 |        1 | 2 | 3 | 4 |   5 | 6 | 7 | 8 |
|---+----------+---+---+---+-----+---+---+---|
|   | (19, 28) |   |   |   | (5) |   |   |   |
|---+----------+---+---+---+-----+---+---+---|

5. The keys remaining: 20, 33, 12, 17, 10
|---+----------+---+---+---+-----+------+---+---|
| 0 |        1 | 2 | 3 | 4 |   5 |    6 | 7 | 8 |
|---+----------+---+---+---+-----+------+---+---|
|   | (19, 28) |   |   |   | (5) | (15) |   |   |
|---+----------+---+---+---+-----+------+---+---|

6. The keys remaining: 33, 12, 17, 10
|---+----------+------+---+---+-----+------+---+---|
| 0 |        1 |    2 | 3 | 4 |   5 |    6 | 7 | 8 |
|---+----------+------+---+---+-----+------+---+---|
|   | (19, 28) | (20) |   |   | (5) | (15) |   |   |
|---+----------+------+---+---+-----+------+---+---|

7. The keys remaining: 12, 17, 10
|---+----------+------+---+---+-----+----------+---+---|
| 0 |        1 |    2 | 3 | 4 |   5 |        6 | 7 | 8 |
|---+----------+------+---+---+-----+----------+---+---|
|   | (19, 28) | (20) |   |   | (5) | (33, 15) |   |   |
|---+----------+------+---+---+-----+----------+---+---|

8. The keys remaining: 17, 10
|---+----------+------+------+---+-----+----------+---+---|
| 0 |        1 |    2 |    3 | 4 |   5 |        6 | 7 | 8 |
|---+----------+------+------+---+-----+----------+---+---|
|   | (19, 28) | (20) | (12) |   | (5) | (33, 15) |   |   |
|---+----------+------+------+---+-----+----------+---+---|

9. The keys remaining: 10
|---+----------+------+------+---+-----+----------+---+------|
| 0 |        1 |    2 |    3 | 4 |   5 |        6 | 7 |    8 |
|---+----------+------+------+---+-----+----------+---+------|
|   | (19, 28) | (20) | (12) |   | (5) | (33, 15) |   | (17) |
|---+----------+------+------+---+-----+----------+---+------|

10. No keys remaining
|---+--------------+------+------+---+-----+----------+---+------|
| 0 |            1 |    2 |    3 | 4 |   5 |        6 | 7 |    8 |
|---+--------------+------+------+---+-----+----------+---+------|
|   | (10, 19, 28) | (20) | (12) |   | (5) | (33, 15) |   | (17) |
|---+--------------+------+------+---+-----+----------+---+------|
</pre>
</div>
</div>
<div id="outline-container-org5105abe" class="outline-3">
<h3 id="org5105abe">11.2-3</h3>
<div class="outline-text-3" id="text-org5105abe">
<p>
The data structure of the chain would affect the running time after the
modification.
</p>

<p>
If we are using linked list as the chain, then the average running time for
successful searches, unsuccessful searches and insertions is
\(O(1 + \alpha)\), the average running time for deletions is \(O(1)\).
</p>

<p>
If we are using more efficient data structure, e.g. skip list with \(O(n)\)
extra space, as the chain, then the average running time for successful
searches, unsuccessful searches and insertions is \(O(1 + \lg\alpha)\), the
average running time for deletions is \(O(1)\).
</p>
</div>
</div>
<div id="outline-container-orgaf3b484" class="outline-3">
<h3 id="orgaf3b484">11.2-4</h3>
<div class="outline-text-3" id="text-orgaf3b484">
<p>
Define a hash table <code>T</code> and a free list <code>F</code> within, each slot <code>s</code> stores one
flag <code>s.free?</code> and two pointers, <code>s.prev</code> and <code>s.next</code>.
</p>
<pre class="example">
INITIALIZE(T, F)
    let F to be a new doubly linked list
    for i = T.length down to 1
        T[i].free? = True
        LINKED-LIST-INSERT(F, T[i])

SEARCH(T, F, k)
    s = T[h(k)]
    if not s.free?
        return LINKED-LIST-SEARCH(s.next, k)
    return NIL

INSERT(T, F, x)
    s = T[h(x.key)]
    if s.free?
        LINKED-LIST-DELETE(F, s)
        let s.next to be a new doubly linked list
    LINKED-LIST-INSERT(s.next, x)

DELETE(T, F, x)
    s = T[h(x.key)]
    LINKED-LIST-DELETE(s.next, x)
    if LINKED-LIST-EMPTY?(s.next)
        s.free? = True
        LINKED-LIST-INSERT(F, s)
</pre>
<p>
The free list need to be doubly linked, to ensure the \(O(1)\) running time
for deletion in the free list.
</p>
</div>
</div>
<div id="outline-container-orgbc44c11" class="outline-3">
<h3 id="orgbc44c11">11.2-5</h3>
<div class="outline-text-3" id="text-orgbc44c11">
<p>
Assume that when we hash all keys from \(U\) to the hash table, we hash no
more than \(n\) keys to the same slot, then the total number of keys in the
hash table is no more than \(nm\), which conflicts with the precondition
\(|U|>nm\), thus \(U\) must have a subset of size \(n\) consisting of keys
that all hash to the same slot, so that the worst-case searching time for
hashing with chaining is \(\Theta(n)\).
</p>
</div>
</div>
<div id="outline-container-orgd96e0d2" class="outline-3">
<h3 id="orgd96e0d2">11.2-6</h3>
<div class="outline-text-3" id="text-orgd96e0d2">
<p>
We could select a key uniformly at random from among the keys in the hash
table as below.
</p>
<ol class="org-ol">
<li>Randomly select \(i\)th chain from the \(m\) chains.</li>
<li>Randomly select an index \(k\) from \([1, L]\), if \(k\) is no more than
the length \(n_i\) of the \(i\)th chain, then we return the \(k\)th
element of the \(i\)th chain, else we repeat steps 1-2.</li>
</ol>
<p>
First we analyze the expected count of experiments of steps 1-2, to complete
the selection, the probability of each experiment is \(\alpha / L\), thus the
expected count of experiments is \(L / \alpha\), and the expected running
time of repetition is \(O(L / \alpha)\). And we know the expected running
time of key selection from a single chain is \(O(L)\), thus the total
expected running time is \(O(L \cdot (1 + 1 / \alpha))\).
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: pedh</p>
<p class="date">Created: 2023-08-17 Thu 10:36</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>